{
  "block": "hardwareB3",
  "module": "0_2",
  "moduleTitle": "Module 0.2: Longhorn Neurotech Onboarding Project Competition Information",
  "infoSections": [
    {
      "type": "text",
      "text": "Get ready! Once you complete the onboarding modules, you’ll have the chance to put your new skills into action in our Onboarding Project Competition, starting in late October."
    },
    {
      "type": "text",
      "text": "What is it?"
    },
    {
      "type": "text",
      "text": "The competition is a chance for new members to work in small teams on hands-on neurotech projects inspired by the work that Longhorn Neurotech (LHNT) is currently doing."
    },
    {
      "type": "text",
      "text": "These projects are designed to:"
    },
    {
      "type": "text",
      "text": "* Give you relevant experience in hardware, software, and research."
    },
    {
      "type": "text",
      "text": "* Help you apply what you learned in the onboarding modules."
    },
    {
      "type": "text",
      "text": "* Provide a strong addition to your resume and CV."
    },
    {
      "type": "text",
      "text": "How does it work?"
    },
    {
      "type": "text",
      "text": "* After completing all modules, you’ll form teams with another 4-5 onboarding members."
    },
    {
      "type": "text",
      "text": "* Each team will take on a project challenge related to neurotechnology."
    },
    {
      "type": "text",
      "text": "* Projects will be ranked and evaluated by a judging panel."
    },
    {
      "type": "text",
      "text": "* Your performance will help determine role placement in official LHNT project teams for the year."
    },
    {
      "type": "text",
      "text": "Why compete?"
    },
    {
      "type": "text",
      "text": "* Gain real-world neurotech experience that connects directly to our ongoing projects."
    },
    {
      "type": "text",
      "text": "* Meet and collaborate with other motivated new members."
    },
    {
      "type": "text",
      "text": "* Stand out early as you build your place in LHNT."
    },
    {
      "type": "text",
      "text": "Timeline:"
    },
    {
      "type": "text",
      "text": "* Competition launch: late October"
    },
    {
      "type": "text",
      "text": "* Final presentations + evaluation: early December"
    },
    {
      "type": "text",
      "text": "* More details coming soon!"
    },
    {
      "type": "text",
      "text": "Stay tuned! We’ll be sharing the full competition structure, team formation process, and project prompts in October."
    },
    {
      "type": "text",
      "text": "We can’t wait to see what you build, create, and innovate!"
    }
  ],
  "tasks": [],
  "extraResources": []
}