{
  "block": "softwareB1",
  "module": "2_1",
  "moduleTitle": "Module 2.1: Python Basics",
  "infoSections": [
    {
      "type": "text",
      "text": "**Python** is an essential programming language for software development in neurotechnology. It is easy to learn and use, making it a great tool for processing neural data, building machine learning models, and automating research tasks. With Python, you can develop skills in data analysis, signal processing, and algorithm design, which are key for working with brain-computer interfaces, neuroimaging, and neural simulations. Its libraries, like NumPy, SciPy, and TensorFlow, help with handling large datasets and applying AI to neuroscience problems. Knowing Python allows you to quickly test ideas, analyze brain signals, and create software for neurotech applications."
    }
  ],
  "tasks": [
    {
      "taskTitle": "Task 1",
      "taskDescription": "Go through this [course]. Send a screenshot of your completion screen/certificate in an email to this email address: lhnt.onboarding@gmail.com. If you are proficient in Python, send a screenshot of a previous project in an email to this email address: lhnt.onboarding@gmail.com instead. If you are stuck at any point, do not hesitate to use the internet or ask for help. However, please refrain from using generative AI during the preliminary stages of learning Python.",
      "links": [
        {
          "label": "course",
          "url": "https://pll.harvard.edu/course/cs50s-introduction-programming-python",
          "required": true
        }
      ],
      "requiredActions": ["clickLinks"]
    }
  ],
 "extraResources": [
    {
      "type": "text",
      "text": "* [scikit-learn Machine Learning in Python] \n\t* [Dive into Deep Learning]",
      "links": [
        {
          "label": "scikit-learn Machine Learning in Python",
          "url": "https://scikit-learn.org/stable/index.html"
        },
        {
          "label": "Dive into Deep Learning",
          "url": "https://d2l.ai/"
        }
      ]
    },
    {
      "type": "video",
      "title": "Getting Started with Python in VS Code (Official Video)",
      "url": "https://www.youtube.com/embed/D2cwvpJSBX4"
    },
    {
      "type": "video",
      "title": "Python Programming Tutorial | Introduction | GeeksforGeeks",
      "url": "https://www.youtube.com/embed/OLPbd-7Pp_8"
    }
  ]
}